Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس كان من الجن ففسق عن أمر ربه أفتتخذونه وذريته أولياء من دوني وهم لكم عدو بئس للظالمين بدلا
en: And (remember) when We said unto the angels: Fall prostrate before Adam, and they fell prostrate, all save Iblis. He was of the jinn, so he rebelled against his Lord's command. Will ye choose him and his seed for your protecting friends instead of Me, when they are an enemy unto you? Calamitous is the exchange for evil-doers.

source: ما أشهدتهم خلق السماوات والأرض ولا خلق أنفسهم وما كنت متخذ المضلين عضدا
en: I made them not to witness the creation of the heavens and the earth, nor their own creation; nor choose I misleaders for (My) helpers.

source: ويوم يقول نادوا شركائي الذين زعمتم فدعوهم فلم يستجيبوا لهم وجعلنا بينهم موبقا
en: And (be mindful of) the Day when He will say: Call those partners of Mine whom ye pretended. Then they will cry unto them, but they will not hear their prayer, and We shall set a gulf of doom between them.

source: ورأى المجرمون النار فظنوا أنهم مواقعوها ولم يجدوا عنها مصرفا
en: And the guilty behold the Fire and know that they are about to fall therein, and they find no way of escape thence.

source: ولقد صرفنا في هذا القرآن للناس من كل مثل وكان الإنسان أكثر شيء جدلا
en: And verily We have displayed for mankind in this Qur'an all manner of similitudes, but man is more than anything contentious.

source: وما منع الناس أن يؤمنوا إذ جاءهم الهدى ويستغفروا ربهم إلا أن تأتيهم سنة الأولين أو يأتيهم العذاب قبلا
en: And naught hindereth mankind from believing when the guidance cometh unto them, and from asking forgiveness of their Lord unless (it be that they wish) that the judgment of the men of old should come upon them or (that) they should be confronted with the Doom.

source: وما نرسل المرسلين إلا مبشرين ومنذرين ويجادل الذين كفروا بالباطل ليدحضوا به الحق واتخذوا آياتي وما أنذروا هزوا
en: We send not the messengers save as bearers of good news and warners. Those who disbelieve contend with falsehood in order to refute the Truth thereby. And they take Our revelations and that wherewith they are threatened as a jest.

source: ومن أظلم ممن ذكر بآيات ربه فأعرض عنها ونسي ما قدمت يداه إنا جعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرا وإن تدعهم إلى الهدى فلن يهتدوا إذا أبدا
en: And who doth greater wrong than he who hath been reminded of the revelations of his Lord, yet turneth away from them and forgetteth what his hands send forward (to the Judgment)? Lo! on their hearts We have placed coverings so that they understand not, and in their ears a deafness. And though thou call them to the guidance, in that case they can never be led aright.

source: وربك الغفور ذو الرحمة لو يؤاخذهم بما كسبوا لعجل لهم العذاب بل لهم موعد لن يجدوا من دونه موئلا
en: Thy Lord is the Forgiver, Full of Mercy. If He took them to task (now) for what they earn, He would hasten on the doom for them; but theirs is an appointed term from which they will find no escape.

source: وتلك القرى أهلكناهم لما ظلموا وجعلنا لمهلكهم موعدا
en: And (all) those townships! We destroyed them when they did wrong, and We appointed a fixed time for their destruction.

source: وإذ قال موسى لفتاه لا أبرح حتى أبلغ مجمع البحرين أو أمضي حقبا
en: And when Moses said unto his servant: I will not give up until I reach the point where the two rivers meet, though I march on for ages.

source: فلما بلغا مجمع بينهما نسيا حوتهما فاتخذ سبيله في البحر سربا
en: And when they reached the point where the two met, they forgot their fish, and it took its way into the waters, being free.

source: فلما جاوزا قال لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا نصبا
en: And when they had gone further, he said unto his servant: Bring us our breakfast. Verily we have found fatigue in this our journey.

source: قال أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره واتخذ سبيله في البحر عجبا
en: He said: Didst thou see, when we took refuge on the rock, and I forgot the fish - and none but Satan caused me to forget to mention it - it took its way into the waters by a marvel.

source: قال ذلك ما كنا نبغ فارتدا على آثارهما قصصا
en: He said: This is that which we have been seeking. So they retraced their steps again.

source: فوجدا عبدا من عبادنا آتيناه رحمة من عندنا وعلمناه من لدنا علما
en: Then found they one of Our slaves, unto whom We had given mercy from Us, and had taught him knowledge from Our presence.

source: قال له موسى هل أتبعك على أن تعلمن مما علمت رشدا
en: Moses said unto him: May I follow thee, to the end that thou mayst teach me right conduct of that which thou hast been taught?

source: قال إنك لن تستطيع معي صبرا
en: He said: Lo! thou canst not bear with me.

source: وكيف تصبر على ما لم تحط به خبرا
en: How canst thou bear with that whereof thou canst not compass any knowledge?

source: قال ستجدني إن شاء الله صابرا ولا أعصي لك أمرا
en: He said: Allah willing, thou shalt find me patient and I shall not in aught gainsay thee.

source: قال فإن اتبعتني فلا تسألني عن شيء حتى أحدث لك منه ذكرا
en: He said: Well, if thou go with me, ask me not concerning aught till I myself make mention of it unto thee.

source: فانطلقا حتى إذا ركبا في السفينة خرقها قال أخرقتها لتغرق أهلها لقد جئت شيئا إمرا
en: So they twain set out till, when they were in the ship, he made a hole therein. (Moses) said: Hast thou made a hole therein to drown the folk thereof? Thou verily hast done a dreadful thing.

source: قال ألم أقل إنك لن تستطيع معي صبرا
en: He said: Did I not tell thee that thou couldst not bear with me?

source: قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا
en: (Moses) said: Be not wroth with me that I forgot, and be not hard upon me for my fault.

source: فانطلقا حتى إذا لقيا غلاما فقتله قال أقتلت نفسا زكية بغير نفس لقد جئت شيئا نكرا
en: So they twain journeyed on till, when they met a lad, he slew him. (Moses) said: What! Hast thou slain an innocent soul who hath slain no man? Verily thou hast done a horrid thing.

source: قال ألم أقل لك إنك لن تستطيع معي صبرا
en: He said: Did I not tell thee that thou couldst not bear with me?

source: قال إن سألتك عن شيء بعدها فلا تصاحبني قد بلغت من لدني عذرا
en: (Moses) said: If I ask thee after this concerning aught, keep not company with me. Thou hast received an excuse from me.

source: فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض فأقامه قال لو شئت لاتخذت عليه أجرا
en: So they twain journeyed on till, when they came unto the folk of a certain township, they asked its folk for food, but they refused to make them guests. And they found therein a wall upon the point of falling into ruin, and he repaired it. (Moses) said: If thou hadst wished, thou couldst have taken payment for it.

source: قال هذا فراق بيني وبينك سأنبئك بتأويل ما لم تستطع عليه صبرا
en: He said: This is the parting between thee and me! I will announce unto thee the interpretation of that thou couldst not bear with patience.

source: أما السفينة فكانت لمساكين يعملون في البحر فأردت أن أعيبها وكان وراءهم ملك يأخذ كل سفينة غصبا
en: As for the ship, it belonged to poor people working on the river, and I wished to mar it, for there was a king behind them who is taking every ship by force.

source: وأما الغلام فكان أبواه مؤمنين فخشينا أن يرهقهما طغيانا وكفرا
en: And as for the lad, his parents were believers and we feared lest he should oppress them by rebellion and disbelief.

source: فأردنا أن يبدلهما ربهما خيرا منه زكاة وأقرب رحما
en: And we intended that their Lord should change him for them for one better in purity and nearer to mercy.

source: وأما الجدار فكان لغلامين يتيمين في المدينة وكان تحته كنز لهما وكان أبوهما صالحا فأراد ربك أن يبلغا أشدهما ويستخرجا كنزهما رحمة من ربك وما فعلته عن أمري ذلك تأويل ما لم تسطع عليه صبرا
en: And as for the wall, it belonged to two orphan boys in the city, and there was beneath it a treasure belonging to them, and their father had been righteous, and thy Lord intended that they should come to their full strength and should bring forth their treasure as a mercy from their Lord; and I did it not upon my own command. Such is the interpretation of that wherewith thou couldst not bear.

source: ويسألونك عن ذي القرنين قل سأتلو عليكم منه ذكرا
en: They will ask thee of Dhu'l-Qarneyn. Say: I shall recite unto you a remembrance of him.

source: إنا مكنا له في الأرض وآتيناه من كل شيء سببا
en: Lo! We made him strong in the land and gave him unto every thing a road.

source: فأتبع سببا
en: And he followed a road

source: حتى إذا بلغ مغرب الشمس وجدها تغرب في عين حمئة ووجد عندها قوما قلنا يا ذا القرنين إما أن تعذب وإما أن تتخذ فيهم حسنا
en: Till, when he reached the setting-place of the sun, he found it setting in a muddy spring, and found a people thereabout. We said: O Dhu'l-Qarneyn! Either punish or show them kindness.

source: قال أما من ظلم فسوف نعذبه ثم يرد إلى ربه فيعذبه عذابا نكرا
en: He said: As for him who doeth wrong, we shall punish him, and then he will be brought back unto his Lord, Who will punish him with awful punishment!

source: وأما من آمن وعمل صالحا فله جزاء الحسنى وسنقول له من أمرنا يسرا
en: But as for him who believeth and doeth right, good will be his reward, and We shall speak unto him a mild command.

source: ثم أتبع سببا
en: Then he followed a road

source: حتى إذا بلغ مطلع الشمس وجدها تطلع على قوم لم نجعل لهم من دونها سترا
en: Till, when he reached the rising-place of the sun, he found it rising on a people for whom We had appointed no shelter therefrom.

source: كذلك وقد أحطنا بما لديه خبرا
en: So (it was). And We knew all concerning him.

source: حتى إذا بلغ بين السدين وجد من دونهما قوما لا يكادون يفقهون قولا
en: Till, when he came between the two mountains, he found upon their hither side a folk that scarce could understand a saying.

source: قالوا يا ذا القرنين إن يأجوج ومأجوج مفسدون في الأرض فهل نجعل لك خرجا على أن تجعل بيننا وبينهم سدا
en: They said: O Dhu'l-Qarneyn! Lo! Gog and Magog are spoiling the land. So may we pay thee tribute on condition that thou set a barrier between us and them?

source: قال ما مكني فيه ربي خير فأعينوني بقوة أجعل بينكم وبينهم ردما
en: He said: That wherein my Lord hath established me is better (than your tribute). Do but help me with strength (of men), I will set between you and them a bank.

source: آتوني زبر الحديد حتى إذا ساوى بين الصدفين قال انفخوا حتى إذا جعله نارا قال آتوني أفرغ عليه قطرا
en: Give me pieces of iron - till, when he had levelled up (the gap) between the cliffs, he said: Blow! - till, when he had made it a fire, he said: Bring me molten copper to pour thereon.

source: فما اسطاعوا أن يظهروه وما استطاعوا له نقبا
en: And (Gog and Magog) were not able to surmount, nor could they pierce (it).

source: قال هذا رحمة من ربي فإذا جاء وعد ربي جعله دكاء وكان وعد ربي حقا
en: He said: This is a mercy from my Lord; but when the promise of my Lord cometh to pass, He will lay it low, for the promise of my Lord is true.

source: وتركنا بعضهم يومئذ يموج في بعض ونفخ في الصور فجمعناهم جمعا
en: And on that day we shall let some of them surge against others, and the Trumpet will be blown. Then We shall gather them together in one gathering.

source: وعرضنا جهنم يومئذ للكافرين عرضا
en: On that day we shall present hell to the disbelievers, plain to view,

source: الذين كانت أعينهم في غطاء عن ذكري وكانوا لا يستطيعون سمعا
en: Those whose eyes were hoodwinked from My reminder, and who could not bear to hear.

source: أفحسب الذين كفروا أن يتخذوا عبادي من دوني أولياء إنا أعتدنا جهنم للكافرين نزلا
en: Do the disbelievers reckon that they can choose My bondmen as protecting friends beside Me? Lo! We have prepared hell as a welcome for the disbelievers.

source: قل هل ننبئكم بالأخسرين أعمالا
en: Say: Shall We inform you who will be the greatest losers by their works?

source: الذين ضل سعيهم في الحياة الدنيا وهم يحسبون أنهم يحسنون صنعا
en: Those whose effort goeth astray in the life of the world, and yet they reckon that they do good work.

source: أولئك الذين كفروا بآيات ربهم ولقائه فحبطت أعمالهم فلا نقيم لهم يوم القيامة وزنا
en: Those are they who disbelieve in the revelations of their Lord and in the meeting with Him. Therefor their works are vain, and on the Day of Resurrection We assign no weight to them.

source: ذلك جزاؤهم جهنم بما كفروا واتخذوا آياتي ورسلي هزوا
en: That is their reward: hell, because they disbelieved, and made a jest of Our revelations and Our messengers.

source: إن الذين آمنوا وعملوا الصالحات كانت لهم جنات الفردوس نزلا
en: Lo! those who believe and do good works, theirs are the Gardens of Paradise for welcome,

source: خالدين فيها لا يبغون عنها حولا
en: Wherein they will abide, with no desire to be removed from thence.

source: قل لو كان البحر مدادا لكلمات ربي لنفد البحر قبل أن تنفد كلمات ربي ولو جئنا بمثله مددا
en: Say: Though the sea became ink for the Words of my Lord, verily the sea would be used up before the words of my Lord were exhausted, even though We brought the like thereof to help.

source: قل إنما أنا بشر مثلكم يوحى إلي أنما إلهكم إله واحد فمن كان يرجو لقاء ربه فليعمل عملا صالحا ولا يشرك بعبادة ربه أحدا
en: Say: I am only a mortal like you. My Lord inspireth in me that your Allah is only One Allah. And whoever hopeth for the meeting with his Lord, let him do righteous work, and make none sharer of the worship due unto his Lord.

source: كهيعص
en: Kaf. Ha. Ya. A'in. Sad.

source: ذكر رحمت ربك عبده زكريا
en: A mention of the mercy of thy Lord unto His servant Zachariah.

source: إذ نادى ربه نداء خفيا
en: When he cried unto his Lord a cry in secret,

source: قال رب إني وهن العظم مني واشتعل الرأس شيبا ولم أكن بدعائك رب شقيا
en: Saying: My Lord! Lo! the bones of me wax feeble and my head is shining with grey hair, and I have never been unblest in prayer to Thee, my Lord.

source: وإني خفت الموالي من ورائي وكانت امرأتي عاقرا فهب لي من لدنك وليا
en: Lo! I fear my kinsfolk after me, since my wife is barren. Oh, give me from Thy presence a successor

source: يرثني ويرث من آل يعقوب واجعله رب رضيا
en: Who shall inherit of me and inherit (also) of the house of Jacob. And make him, my Lord, acceptable (unto Thee).

source: يا زكريا إنا نبشرك بغلام اسمه يحيى لم نجعل له من قبل سميا
en: (It was said unto him): O Zachariah! Lo! We bring thee tidings of a son whose name is John; we have given the same name to none before (him).

source: قال رب أنى يكون لي غلام وكانت امرأتي عاقرا وقد بلغت من الكبر عتيا
en: He said: My Lord! How can I have a son when my wife is barren and I have reached infirm old age?

source: قال كذلك قال ربك هو علي هين وقد خلقتك من قبل ولم تك شيئا
en: He said: So (it will be). Thy Lord saith: It is easy for Me, even as I created thee before, when thou wast naught.

source: قال رب اجعل لي آية قال آيتك ألا تكلم الناس ثلاث ليال سويا
en: He said: My Lord! Appoint for me some token. He said: Thy token is that thou, with no bodily defect, shalt not speak unto mankind three nights.

source: فخرج على قومه من المحراب فأوحى إليهم أن سبحوا بكرة وعشيا
en: Then he came forth unto his people from the sanctuary, and signified to them: Glorify your Lord at break of day and fall of night.

source: يا يحيى خذ الكتاب بقوة وآتيناه الحكم صبيا
en: (And it was said unto his son): O John! Hold fast the Scripture. And we gave him wisdom when a child,

source: وحنانا من لدنا وزكاة وكان تقيا
en: And compassion from Our presence, and purity; and he was devout,

source: وبرا بوالديه ولم يكن جبارا عصيا
en: And dutiful toward his parents. And he was not arrogant, rebellious.

source: وسلام عليه يوم ولد ويوم يموت ويوم يبعث حيا
en: Peace on him the day he was born, and the day he dieth and the day he shall be raised alive!

source: واذكر في الكتاب مريم إذ انتبذت من أهلها مكانا شرقيا
en: And make mention of Mary in the Scripture, when she had withdrawn from her people to a chamber looking East,

source: فاتخذت من دونهم حجابا فأرسلنا إليها روحنا فتمثل لها بشرا سويا
en: And had chosen seclusion from them. Then We sent unto her Our Spirit and it assumed for her the likeness of a perfect man.

source: قالت إني أعوذ بالرحمن منك إن كنت تقيا
en: She said: Lo! I seek refuge in the Beneficent One from thee, if thou art Allah-fearing.

source: قال إنما أنا رسول ربك لأهب لك غلاما زكيا
en: He said: I am only a messenger of thy Lord, that I may bestow on thee a faultless son.

source: قالت أنى يكون لي غلام ولم يمسسني بشر ولم أك بغيا
en: She said: How can I have a son when no mortal hath touched me, neither have I been unchaste?

source: قال كذلك قال ربك هو علي هين ولنجعله آية للناس ورحمة منا وكان أمرا مقضيا
en: He said: So (it will be). Thy Lord saith: It is easy for Me. And (it will be) that We may make of him a revelation for mankind and a mercy from Us, and it is a thing ordained.

source: فحملته فانتبذت به مكانا قصيا
en: And she conceived him, and she withdrew with him to a far place.

source: فأجاءها المخاض إلى جذع النخلة قالت يا ليتني مت قبل هذا وكنت نسيا منسيا
en: And the pangs of childbirth drove her unto the trunk of the palm-tree. She said: Oh, would that I had died ere this and had become a thing of naught, forgotten!

source: فناداها من تحتها ألا تحزني قد جعل ربك تحتك سريا
en: Then (one) cried unto her from below her, saying: Grieve not! Thy Lord hath placed a rivulet beneath thee,

source: وهزي إليك بجذع النخلة تساقط عليك رطبا جنيا
en: And shake the trunk of the palm-tree toward thee, thou wilt cause ripe dates to fall upon thee.

source: فكلي واشربي وقري عينا فإما ترين من البشر أحدا فقولي إني نذرت للرحمن صوما فلن أكلم اليوم إنسيا
en: So eat and drink and be consoled. And if thou meetest any mortal, say: Lo! I have vowed a fast unto the Beneficent, and may not speak this day to any mortal.

source: فأتت به قومها تحمله قالوا يا مريم لقد جئت شيئا فريا
en: Then she brought him to her own folk, carrying him. They said: O Mary! Thou hast come with an amazing thing.

source: يا أخت هارون ما كان أبوك امرأ سوء وما كانت أمك بغيا
en: O sister of Aaron! Thy father was not a wicked man nor was thy mother a harlot.

source: فأشارت إليه قالوا كيف نكلم من كان في المهد صبيا
en: Then she pointed to him. They said: How can we talk to one who is in the cradle, a young boy?

source: قال إني عبد الله آتاني الكتاب وجعلني نبيا
en: He spake: Lo! I am the slave of Allah. He hath given me the Scripture and hath appointed me a Prophet,

source: وجعلني مباركا أين ما كنت وأوصاني بالصلاة والزكاة ما دمت حيا
en: And hath made me blessed wheresoever I may be, and hath enjoined upon me prayer and almsgiving so long as I remain alive,

source: وبرا بوالدتي ولم يجعلني جبارا شقيا
en: And (hath made me) dutiful toward her who bore me, and hath not made me arrogant, unblest.

source: والسلام علي يوم ولدت ويوم أموت ويوم أبعث حيا
en: Peace on me the day I was born, and the day I die, and the day I shall be raised alive!

source: ذلك عيسى ابن مريم قول الحق الذي فيه يمترون
en: Such was Jesus, son of Mary: (this is) a statement of the truth concerning which they doubt.

source: ما كان لله أن يتخذ من ولد سبحانه إذا قضى أمرا فإنما يقول له كن فيكون
en: It befitteth not (the Majesty of) Allah that He should take unto Himself a son. Glory be to Him! When He decreeth a thing, He saith unto it only: Be! and it is.

source: وإن الله ربي وربكم فاعبدوه هذا صراط مستقيم
en: And lo! Allah is my Lord and your Lord. So serve Him. That is the right path.

source: فاختلف الأحزاب من بينهم فويل للذين كفروا من مشهد يوم عظيم
en: The sects among them differ: but woe unto the disbelievers from the meeting of an awful Day.

source: أسمع بهم وأبصر يوم يأتوننا لكن الظالمون اليوم في ضلال مبين
en: See and hear them on the Day they come unto Us! yet the evil-doers are to-day in error manifest.

source: وأنذرهم يوم الحسرة إذ قضي الأمر وهم في غفلة وهم لا يؤمنون
en: And warn them of the Day of anguish when the case hath been decided. Now they are in a state of carelessness, and they believe not.

source: إنا نحن نرث الأرض ومن عليها وإلينا يرجعون
en: Lo! We, only We, inherit the earth and all who are thereon, and unto Us they are returned.

source: واذكر في الكتاب إبراهيم إنه كان صديقا نبيا
en: And make mention (O Muhammad) in the Scripture of Abraham. Lo! he was a saint, a prophet.

source: إذ قال لأبيه يا أبت لم تعبد ما لا يسمع ولا يبصر ولا يغني عنك شيئا
en: When he said unto his father: O my father! Why worshippest thou that which heareth not nor seeth, nor can in aught avail thee?

source: يا أبت إني قد جاءني من العلم ما لم يأتك فاتبعني أهدك صراطا سويا
en: O my father! Lo! there hath come unto me of knowledge that which came not unto thee. So follow me, and I will lead thee on a right path.

source: يا أبت لا تعبد الشيطان إن الشيطان كان للرحمن عصيا
en: O my father! Serve not the devil. Lo! the devil is a rebel unto the Beneficent.

source: يا أبت إني أخاف أن يمسك عذاب من الرحمن فتكون للشيطان وليا
en: O my father! Lo! I fear lest a punishment from the Beneficent overtake thee so that thou become a comrade of the devil.

source: قال أراغب أنت عن آلهتي يا إبراهيم لئن لم تنته لأرجمنك واهجرني مليا
en: He said: Rejectest thou my gods, O Abraham? If thou cease not, I shall surely stone thee. Depart from me a long while!

source: قال سلام عليك سأستغفر لك ربي إنه كان بي حفيا
en: He said: Peace be unto thee! I shall ask forgiveness of my Lord for thee. Lo! He was ever gracious unto me.

source: وأعتزلكم وما تدعون من دون الله وأدعو ربي عسى ألا أكون بدعاء ربي شقيا
en: I shall withdraw from you and that unto which ye pray beside Allah, and I shall pray unto my Lord. It may be that, in prayer unto my Lord, I shall not be unblest.

source: فلما اعتزلهم وما يعبدون من دون الله وهبنا له إسحاق ويعقوب وكلا جعلنا نبيا
en: So, when he had withdrawn from them and that which they were worshipping beside Allah, We gave him Isaac and Jacob. Each of them We made a prophet.

source: ووهبنا لهم من رحمتنا وجعلنا لهم لسان صدق عليا
en: And we gave them of Our mercy, and assigned to them a high and true renown.

source: واذكر في الكتاب موسى إنه كان مخلصا وكان رسولا نبيا
en: And make mention in the Scripture of Moses. Lo! he was chosen, and he was a messenger (of Allah), a prophet.

source: وناديناه من جانب الطور الأيمن وقربناه نجيا
en: We called him from the right slope of the Mount, and brought him nigh in communion.

source: ووهبنا له من رحمتنا أخاه هارون نبيا
en: And We bestowed upon him of Our mercy his brother Aaron, a prophet (likewise).

source: واذكر في الكتاب إسماعيل إنه كان صادق الوعد وكان رسولا نبيا
en: And make mention in the Scripture of Ishmael. Lo! he was a keeper of his promise, and he was a messenger (of Allah), a prophet.

source: وكان يأمر أهله بالصلاة والزكاة وكان عند ربه مرضيا
en: He enjoined upon his people worship and almsgiving, and was acceptable in the sight of his Lord.

source: واذكر في الكتاب إدريس إنه كان صديقا نبيا
en: And make mention in the Scripture of Idris. Lo! he was a saint, a prophet;

source: ورفعناه مكانا عليا
en: And We raised him to high station.

source: أولئك الذين أنعم الله عليهم من النبيين من ذرية آدم وممن حملنا مع نوح ومن ذرية إبراهيم وإسرائيل وممن هدينا واجتبينا إذا تتلى عليهم آيات الرحمن خروا سجدا وبكيا
en: These are they unto whom Allah showed favour from among the prophets, of the seed of Adam and of those whom We carried (in the ship) with Noah, and of the seed of Abraham and Israel, and from among those whom We guided and chose. When the revelations of the Beneficent were recited unto them, they fell down, adoring and weeping.

source: فخلف من بعدهم خلف أضاعوا الصلاة واتبعوا الشهوات فسوف يلقون غيا
en: Now there hath succeeded them a later generation whom have ruined worship and have followed lusts. But they will meet deception.

source: إلا من تاب وآمن وعمل صالحا فأولئك يدخلون الجنة ولا يظلمون شيئا
en: Save him who shall repent and believe and do right. Such will enter the Garden, and they will not be wronged in aught -

source: جنات عدن التي وعد الرحمن عباده بالغيب إنه كان وعده مأتيا
en: Gardens of Eden, which the Beneficent hath promised to His slaves in the unseen. Lo! His promise is ever sure of fulfilment -
